package com.kh.IfEx;
	/*
	* if
	- (  )안의 조건이 true일 때만 특정 코드블록을 실행하는 제어문
	
		if(조건) {
			조건이 참일 때 실행하는 코드
		}
	
	* if - else if - else
	- else if는 만들고 싶은 조건의 수 만큼 무한정 만들 수 있음.
	- if와 else는 1회만 작성 가능
	- if는 생략이 불가능하지만 else if, else는 작성하지 않아도 문제 없음.
			
		if(조건1) {
			조건1이 참일 때 실행되는 코드
		}
		else if(조건2) {
			조건1이 거짓이고 조건2가 참일 때 실행되는 코드
		}
		else {
			위 모든 조건이 거짓일 때 실행되는 코드
		}
		
	* if - else
	- if의 조건이 거짓일 떄 실행하고자 하는 내용이 있다면 else를 사용해서 { }안에 거짓에 대한 내용 작성
		
		if(조건) {
			조건이 참일 때 실행되는 코드
		}
		else {
			조건이 거짓일 때 실행되는 코드
		}
	
	* 간단하게 사용하는 if else문(삼항연산자)
		
		(조건)     ?      true일 떄 진행할 내용  :   false일 떄 진행할 내용
	
	if문에서 블록 안에는 System.out.print 이외 내가 작성하고 싶은 코드를 모두 작성할 수 있지만
	현재 출력문을 사용하는 사용하는 방식이 익히기 편하기 떄문에 위와 같은 출력문만 작성하는 것일 뿐.
	print만 되는 것은 아님
	
	*/
	

public class If문 {

}
