package com.kh.regularEx;

public class 정규식 {
/*
	정규식(Regular Expression)
	- 문자열이나 특정한 규칙이나 패턴을 찾거나 검색할 때 유용하게 사용하기 위한 표현 방법
	
	1. 문자
		[abc] : a,b,c 중 하나와 일치하면 됨
		[^abc] : a,b,c 이외의 문자와 일치하면 됨
		[a-z] : 소문자 a부터 z까지의 문자와 일치하는지 확인
		[A-Z] : 대문자 A부터 Z까지의 문자와 일치하는지 확인
		[0-9] : 숫자0~9의 문자와 일치하는지 확인([n-m]으로 범위 조정 가능)
		[가-힣] : 한글 가~힣 모든 한글 문자가 일치하는지 확인
		[ㄱ-ㅎ] : 한글 자음 ㄱ~ㅎ 모든 자음이 일치하는지 확인
		[ㅏ-ㅣ] : 한글 모음 ㅏ~ㅣ 모든 모음이 일치하는지 확인
		
	2.지정자
		* : 0개 이상 문자와 일치하는지 확인. 똑같지 않아도 됨
		+ : 1개 이상의 문자와 일치하는지 확인
		? : 0 또는 1개의 문자와 일치하는지 확인
		{n} : 정확하게 n개의 문자와 일치
		{n, } : 최소 n개 이상의 문자와 일치
		{n,m} : 최소 n개 이상, 최대 m개의 문자와 일치
		
	3. 특수문자
		. : 어떤 한 문자와 일치
		^ : 문자열의 시작부분과 일치
		$ : 문자열의 끝부분과 일치
		\ : 특수문자를 사용할 것임을 알려주는 표시
			->특수문자를 사용하길 원한다면 \작성 후 뒤에 넣어줘야함
			
	정규식을 사용할때 사용방법
	Pattern.matches()를 사용해서 		
			
			
			
			
			
			
	*/
	
	
	
	
	
	
	
}
