package com.kh.OopEx;

public interface 인터페이스 {
/*
	인터페이스
	- 미완성된 클래스(클래스가 아님)
	- 메서드를 작성할 때 메서드 이름과 메서드 매개변수 및 반환을 어떻게 처리할지만 지정
	- 메서드의 본 내용을 작성하지 않음
	- 상속할 때 implements로 작성 후 인터페이스 파일명을 작성해줌
	- 상속할 때 여러개 작성 가능
	- extends를 사용한 다음 implements를 사용해도 됨
	=> public class 자식 extends 부모 implements 엄마, 아빠
	- 인터페이스에 작성되는 필드들은 모두 상수로 작성이 되기 때문에 대문자로 변수명을 작성해야함
	- 인터페이스는 외부에서 완성을 해줘야하기 때문에 public을 사용
	
	접근제한자     반환유무     메서드명();
			(void 자료형)
		
	인터페이스에서 사용하면 안되는 메서드 예제
	* 접근제한자 void 메서드이름() {
				
	}
			
	* 접근제한자 자료형 메서드이름() {
		
	}
	=> {}를 추가하면 안됨 그냥
*/			
}			
